Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles
This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form 3D Path Distribution have.
The tag of a Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle RebarConstrainedHandle
can be obtained by calling the Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()
Since:
2027
Since:
2027

Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles.FirstSegment
Tag for handle representing the first segment in a bar in set. The segment N will have the tag Path3DDistributionRebarHandles.FirstSegment + N - 1.
All segment handles accept constraints only to host edges or to the cover of the host edges. These constraints can have distance to their targets.

Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles.SetOrientation
Tag for handle representing the Set Orientation. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles.EndOfDistributionPath
Tag for handle representing the End Distribution Path. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles.StartOfDistributionPath
Tag for handle representing the Start Distribution Path. This handle accepts constraints only to host faces or to covers.

Autodesk.Revit.DB.Structure.Path3DDistributionRebarHandles.DistributionPath
Tag for handle representing the Distribution Path. This handle accepts constraints only to host edges. The constraint can't have distance to the host edges.